CSI API ETABS v1
eDeckType Enumeration
 The possible deck types.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
public enum eDeckType
Public Enumeration eDeckType
Dim instance As eDeckType
public enum class eDeckType
type eDeckType
Members
Member name | Value | Description
Filled | 1
Unfilled | 2
SolidSlab | 3
Remarks
See Also
Reference
ETABSv1 Namespace